app/controllers/api/addresses_controller.rb

  def index
    @addresses = Address.all.by_token(@token)
---
SELECT "addresses".* FROM "addresses"

  def create
    @address = Address.new(address_params.to_h.merge!({token:@token}))

    if @address.save
---
INSERT INTO "addresses" ("cep", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?)  [["cep", "12223"], ["created_at", "2021-07-15 09:24:26.280786"], ["updated_at", "2021-07-15 09:24:26.280786"], ["token", "1234567899"]]